using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BankLibrary
{
    public class Bank
    {
        private string bankName = "Cупер банк";

        protected string[,] ATM = {
            { "Банкомат 1", "вул. Лесі Українки 10", "ib1234", "150000" },
            { "Банкомат 2", "пр. Миру 5", "ib1267", "120000" },
            { "Банкомат 3", "вул. Центральна 22", "ib2345", "130000" },
            { "Банкомат 4", "вул. Гагаріна 18", "ib3456", "110000" },
            { "Банкомат 5", "вул. Батьківщина 8", "ib4567", "140000" },
            { "Банкомат 6", "вул. Липова 15", "ib5678", "160000" }
        };

        private string[,] bankDepartment = {
            { "Відділення 1", "вул. Лесі Українки 10" },
            { "Відділення 2", "пр. Миру 5" },
            { "Відділення 3", "вул. Центральна 22" },
            { "Відділення 4", "вул. Гагаріна 18" },
            { "Відділення 5", "вул. Батьківщина 8" },
            { "Відділення 6", "вул. Липова 15" }
        };
    }
}
